{
    "id": 271798,
    "brand": "avalanche",
    "name": "DENSETEC POST CONSUMER",
    "slug": "densetec-post-consumer",
    "description": "Densetec® Post Consumer is a 98% (2% color) post consumer product that can be used in a variety of applications. Densetec® Post Consumer is manufactured using a HDPE resin that has been compounded and processed from products such as detergent bottles and/or milk jugs that have been saved from our nation's land fills. Densetec® Post Consumer is Polymer Industries contribution to the “Green Movement” and can be produced for a minimum run, per color, per thickness. Densetec® Post Consumer is manufactured in sheet form or can be fabricated to customer requirements, and can be used to produce products such as Marine Board, Playground Board, Sign Board and Partition Board. Densetec® Post Consumer exhibits virtually the same properties as those of standard HDPE. It is easily fabricated, routed or engraved using current CNC technology. This material can be produced with or without a textured surface. It can be produced using any of Polymer's many stock colors and can be produced with a UV stabilizer making it the perfect choice for outdoor environments. It is an excellent replacement for wood, and because the color is embedded in the sheet, it never needs painting and is also vandal resistant. The versatile properties of Densetec® Post Consumer make it the ideal product for any application that standard HDPE can be used. Polymer Industries has committed considerable resources to the environmental reclamation of HDPE and the development of a product that does not sacrifice the integrity of the application in which it is used. We are proud to be able to offer to our customers and to these industries our “Green ” offering of Densetec® Post Consumer.",
    "company_name": "Nytef Plastics",
    "company_slug": "nytef-plastics",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1691744037/production/Company/20795/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/v1625608779/production/CategoryImage/578/category_image/AutomotiveTransportation_06.jpg",
    "properties": {
        "Applications": [
            "Non-Food Consumer Packaging",
            "Furniture",
            "Wall Panels",
            "Other Consumer Goods Applications",
            "Marine",
            "Housewares",
            "Building Materials",
            "Packaging",
            "Transportation"
        ],
        "Product Families": [
            "Parts, Shapes & Films"
        ],
        "Chemical Family": [
            "Polyolefins",
            "Polyethylenes"
        ],
        "Polymer Name": [
            "High Density Polyethylene (HDPE)"
        ],
        "End Uses": [
            "Bottles",
            "Furniture",
            "Outdoor Furnishings",
            "Marine Applications",
            "Displays"
        ]
    },
    "summary": {
        "Density": [
            "952.0 - 975.0 kg/m³"
        ]
    }
}