{
    "id": 416423,
    "brand": "isobond",
    "name": "IsoBond® HM N1105",
    "slug": "isobond-hm-n1105",
    "description": "IsoBond HM N1105 is a one-component reactive hot melt adhesive that combines quick initial bond strength that continues to develop strength after application in the presence of atmospheric moisture. It reaches 50% of its final hardness within 10 minutes. IsoBond HM N1105 cures into a cross-linked inert structure providing exceptionally high adhesion on a wide variety of substrates while also maintaining superior resistance to extreme temperatures and chemicals. It provides structural bonds on wood products and has mechanical strength meeting or exceeding many commonly used plastics such as acrylic; ABS; and FRP.\nIsoBond HM N1105 has an excellent initial bond; dramatically reducing downtime for a more efficient and productive manufacturing process. Ideal results are obtained when one of the surfaces adhered is permeable to humidity. Impermeable surfaces may require pre-misting to allow thorough curing of the adhesive. Plastics that may have mold release on the surface should be wiped with isopropyl alcohol and allowed to dry before application of IsoBond HM N1105. Once set; the material can only be removed by mechanical means and it should not be removed by burning.",
    "company_name": "Isotec International",
    "company_slug": "isotec-international",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1691739724/production/Brand/32508/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/v1625608962/production/CategoryImage/587/category_image/AdhesivesSealants_04.jpg",
    "properties": {
        "Applications": [
            "Construction Adhesives",
            "Furniture",
            "Adhesives",
            "Building Materials",
            "Construction Chemicals"
        ],
        "Product Families": [
            "Hot Melt Adhesives",
            "Adhesives & Sealants"
        ]
    },
    "summary": {}
}