{
    "id": 358028,
    "brand": "metalon-products",
    "name": "Metalon C2 Anti-Wear Friction Fighter",
    "slug": "metalon-c2-anti-wear-friction-fighter",
    "description": "Metalon C2 Anti-Wear Friction Fighter is distinctly different from any of the so-called \"additives\", which only try to improve the “film strength” of lubricants. In contrast, METALON C2 is a Metal Surface Treatment. METALON combines chemically with the surfaces of bearing metals, (ferrous and non-ferrous), to form a microscopic monomolecular shield. Logically, wear or material removal occurs when oil or grease films separate momentarily and metal is allowed to contact metal. The result is instant friction and removal of small amounts of material every time. This process, which is more or less frequent, (depending on the design of the equipment), adversely affects the equipment life and costly downtime for repairs. Therefore, any additive that claims to improve 'lubrication film strength' is only marginally effective. Since lubrication films do separate and expose bare metal under load, any improvement is momentary. Costly wear and friction occur until the film is re-established. With METALON chemically bonded in place, metal surfaces are protected against devastating “cold starts”. Every time the lubrication film separates, the metal contact surfaces merely burnish (polish) each other instead of being ground away continuously. This burnishing action 'levels' the high spots and ridges, virtually increasing the contact surface area. METALON arrests excessive wear and the significant reduction of friction creates energy savings.",
    "company_name": "Metalon Products",
    "company_slug": "metalon-products",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1680109039/production/Brand/26647/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/v1625608330/production/CategoryImage/555/category_image/Industrial_03.jpg",
    "properties": {
        "Applications": [
            "Other Industrial Applications",
            "Chemical & Industrial Manufacturing",
            "Equipment & Parts"
        ],
        "Product Families": [
            "Lubricants & Oils",
            "Fluids & Lubricants"
        ]
    },
    "summary": {
        "Ready to Use Product Type": [
            "Machining Oils",
            "Cutting Oils",
            "Lubricant",
            "Oil"
        ],
        "Application Area": [
            "Bearings",
            "Pump"
        ],
        "Features": [
            "Friction Reduction",
            "Wear Resistant"
        ]
    }
}