{
    "id": 328693,
    "brand": "pureon-vector",
    "name": "Vector HTS",
    "slug": "vector-hts",
    "description": "Vector HTS products are biodegradable, viscous, polymer/surfactant mixtures formulated to be used with Aluminum oxide (either PWA type or FO Type) and de-ionized water to form a suspension type lapping slurry. Designed primarily for use in lapping silicon wafers, Vector HTS products fully disperse and suspend abrasive material for extended periods of time with relatively little change in physical or chemical characteristics. Designed for use on all types of lapping plates, the products perform particularly well with serrated or grooved plates. The HTS products differ chemically and physically, resulting in differences in wetting, film strength and viscosity. Some of the variables that effect HTS Product choice include: type of lapping plates, type of pumping system, brand of machine, operating pressure, type of abrasive. The choice of Vector HTS products provides the user with precisely the correct chemistry for achieving optimum results from a lapping process. It is a lapping and polishing additive for semiconductor materials.",
    "company_name": "Pureon",
    "company_slug": "pureon",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1708685983/production/Brand/23678/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/v1625608330/production/CategoryImage/555/category_image/Industrial_03.jpg",
    "properties": {
        "Applications": [
            "Automotive Fluids & Lubricants",
            "Fluids & Lubricants",
            "Semiconductor Manufacturing",
            "Lubricants & Functional Fluids",
            "Parts & Components",
            "Chemical & Industrial Manufacturing"
        ],
        "Product Families": [
            "Performance Additives",
            "Additives"
        ],
        "End Uses": [
            "Suspension Fluids",
            "Grinding Oils",
            "Grinding Fluids "
        ]
    },
    "summary": {
        "Functions": [
            "Lapping Additive"
        ],
        "End Uses": [
            "Suspension Fluids",
            "Grinding Fluids ",
            "Grinding Oils"
        ],
        "Compatible Substrates & Surfaces": [
            "Metal",
            "Germanium",
            "Silicon"
        ],
        "Features": [
            "Water-based"
        ]
    }
}