{
    "id": 406195,
    "brand": "h-oexcel",
    "name": "H₂OExcel",
    "slug": "h-oexcel",
    "description": "\n\nH₂OExcel is a 100% biodegradable solution made up of natural ingredients assembled to function as a water conservation agent and nutrient efficiency booster. This unique product is a proprietary formula from Brookside Agra that utilizes the power of natural extracts from desert plants, which have an increased ability to absorb and store water more efficiently than others. H₂OExcel has the unique ability to reduce soil and water surface tension thereby allowing soils to absorb and retain water much faster than normal. H₂OExcel affects the soil capillarity in a way that water can infiltrate faster and deeper than normal. For the majority of land, water will simply take the path of least resistance. It will run off or pool in low-lying areas and evaporate. These conditions commonly lead to overwatering of plants, crops and turf where leaf damage can occur and water does not reach the root system. H₂OExcel enables soils to absorb water faster and deeper than normal by reducing surface tension of both respectively. This puts water in the root zone where it is more readily absorbed and nutrients are made soluble for increased uptake to the plant. Once H₂OExcel infiltrates the soil it will not harm any plants and is not toxic to any animal, making it ideal to use anytime and everywhere. H₂OExcel also serves to increase biological activity around the root zone making more nutrients available. H₂OExcel promotes water efficiency, in turn making water more available, especially during times of stress. The performance of H₂OExcel is second to none as it does not have the limitations of the typical polymer and silicone competitors and is not limited by exposure restrictions. H₂OExcel can lead to water-use reductions of up to 50%, thereby reducing dependence on water and leading to a cost savings for all who take advantage of its unique formula.",
    "company_name": "Brookside Agra",
    "company_slug": "brookside-agra",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1708684770/production/Company/27785/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_512/v1708684770/production/Product/406195/card_banner/image",
    "properties": {
        "Applications": [
            "Fodder & Forage",
            "Sugar & Starch Crops",
            "Fiber Crops",
            "Other Agricultural Crops",
            "Oilseeds",
            "Cereals",
            "Ornamentals",
            "Trees & Woodlands",
            "Fruits",
            "Vegetables",
            "Turf Management",
            "Agricultural Crops",
            "Turf, Ornamentals & Landscape"
        ],
        "Product Families": [
            "Stickers, Surfactants & Wetting Agents",
            "Adjuvants & Formulation Ingredients"
        ]
    },
    "summary": {
        "Functions": [
            "Wetting Agent",
            "Surfactant"
        ],
        "Labeling Claims": [
            "Biodegradable",
            "Natural"
        ]
    }
}