{
    "id": 395315,
    "brand": "ecopur",
    "name": "Rex-Bac-T EP-303 MULTI - PURPOSE",
    "slug": "rex-bac-t-ep-303-multi-purpose",
    "description": "Rex-Bac-T EP-303 MULTI - PURPOSE utilizes the powerful waste digesting abilities of natural enzymes and bacteria. It is a blend of special bacteria strains (both anaerobic and aerobic types) cultured for their ability to digest and liquefy organic sewage quickly, efficiently and without odors! These potent bacteria are combined with natural enzymes to immediately break down all types of organic waste for effective digestion. Regular applications are necessary to replenish the beneficial bacteria and minimize growth of unwanted bacteria that produces odors and noxious gas. These beneficial bacteria cultures are vastly superior to naturally occurring bacteria in digesting waste. Treated systems will reduce BOD and COD faster and more efficiently, enabling the system to treat higher volumes of waste and meet stringent effluent quality requirements. It will help the treatment system to resist temporary disruptions caused by toxic influent, while reducing odors and sludge volume. In septic systems, it will eliminate solids carry-over and odors, and reduce the frequency of pump-outs. It introduces micro-organisms into the soil for improved drainage and smooth operations of drainfields or leach beds",
    "company_name": "Rex-Bac-T",
    "company_slug": "rex-bac-t",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1664292107/production/Company/49460/logo/image.png",
    "banner_url": "https://media.knowde.com/image/upload/v1632515636/production/CategoryImage/1054/category_image/HII_06.jpg",
    "properties": {
        "Applications": [
            "Institutional & Industrial Care",
            "Industrial Cleaning"
        ],
        "Product Families": [
            "Cleaners",
            "Industrial Cleaners",
            "Commercial Cleaners"
        ]
    },
    "summary": {
        "Ready to Use Product Type": [
            "Cleaner",
            "Multipurpose Cleaners"
        ],
        "Application Areas": [
            "Tanks"
        ]
    }
}