{
    "id": 299685,
    "brand": "pel-sil",
    "name": "PEL-SIL™ CL340",
    "slug": "pel-sil-cl340",
    "description": "PEL-SIL™ CL340 is a nonreactive, acetate capped, silicone glycol copolymer surfactant supplied at 100 percent active concentration. It provides slip, gloss enhancement, pigment treatment and leveling for ink and coatings applications. Additionally, it provides mar resistance for coatings applications such as glossy printed materials. PEL-SIL™ CL340 is compatible with acrylic, epoxy, nitrocellulose, phenolic, polyester &amp; polyurethane systems. With a low order of toxicity, this product acts as an anti-stick agent in printing ink applications. It is particularly useful for facilitating the slip of magazine covers over one another during printing and distribution. It is also used as a solubility aid to compatibilize blowing agents with isocyanates in the production of polyurethane foams. PEL-SIL™ CL340 is stable in neutral or mildly acidic or alkaline aqueous solutions. It Imparts anti-blocking and improves mar resistance of PU coatings. PEL-SIL™ CL340 is an effective leveling agent for synthetic leather top coatings.",
    "company_name": "Ele Corporation",
    "company_slug": "ele-corporation",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1697222877/production/Product/299685/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_512/v1697222877/production/Product/299685/card_banner/image",
    "properties": {
        "Applications": [
            "Leather Manufacturing",
            "Flexography",
            "Other Printing & Packaging Applications",
            "Other Paints & Coatings Applications",
            "Industrial Coatings",
            "Finishing",
            "Leather",
            "Printing & Inks",
            "Leather & Textiles"
        ],
        "Product Families": [
            "Surface Modifiers",
            "Functional Additives",
            "Additives"
        ],
        "Chemical Family": [
            "Polyethers"
        ],
        "End Uses": [
            "Waterborne Ink",
            "Waterborne Coating",
            "Top Coat",
            "Solventborne Coating",
            "Flexography Ink"
        ]
    },
    "summary": {}
}