{
    "id": 407159,
    "brand": "super-cal-8",
    "name": "UAS of America Crop Quality Builder",
    "slug": "uas-of-america-crop-quality-builder",
    "description": "Soils have become congested with pollutants placed in our soils, from the years and even decades of over fertilizing with synthetic fertilizers, pesticides, herbicides and fungicides. When soils become so backed up from this over use of these chemicals they cannot freely transfer all the vital nutrients the soils should offer the plant. Beneficial bacteria can convert residue into usable food for roots. When applied directly to the soil, Crop Quality Builder will naturally increase the soil’s organic matter and overall energy level, while conditioning soils to uptake any nutrients it may hold, which normally may not be 100% available. It contains natural ingredients and microbial cultures in a specialized enzyme formulation designed to break down organic waste and increase nitrogen and phosphorous availability. When used as a foliage spray, Crop Quality Builder’s organic sugars, organic carbon and organic matter helps increase and maintain sugar levels in plant allowing the plant to supply sugars and carbohydrates to its fruit, leaves or grains it produces.",
    "company_name": "UAS of America",
    "company_slug": "uas-of-america",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1708683918/production/Company/48822/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/v1625608173/production/CategoryImage/547/category_image/AgricultureFeed_03.jpg",
    "properties": {
        "Applications": [
            "Trees & Woodlands",
            "Turf Management",
            "Turf, Ornamentals & Landscape"
        ],
        "Product Families": [
            "Fertilizers & Nutrients",
            "Plant Health, Nutrients & Soil Management"
        ]
    },
    "summary": {
        "Functions": [
            "Fertilizer"
        ],
        "Application Technique": [
            "Foliage Applied",
            "Chemigation"
        ]
    }
}