{
    "id": 369511,
    "brand": "silicone-elastomer-gel-sicare",
    "name": "Natural OilSilicone Elastomer Gel SiCare® 9908",
    "slug": "natural-oilsilicone-elastomer-gel-sicare-9908",
    "description": "Natural OilSilicone Elastomer Gel SiCare® 9908 is a mixture of ultra-large molecular weight silicone cross-linked polymer dispersing in coconut oil and isoparaffin, without annular silicone oil. It is more moisturizing and more skin-fitting, safe and non-irritating, with quite soft smoothness and refreshing powdery texture. With elasticity, it can reduce the stickiness in formulas, greatly compatible with organic oils, quick adsorption, improve softness and refreshing smoothness. With thickening function, it can improve the appearance of products. Added in products, it can cover tiny wrinkles and bring an instant visually effect of removing wrinkles. When added in primers and foundations, it can greatly improve the spreadability of makeup when applying, and make it easier to apply makeup, looking more skin-fitting and natural. It is oil-controlling, sebum-controlling and refreshing makeup effect. When used in cream products with colored oils, it can increase the whiteness, delicate sense and the texture of products. It is easy to use and can be cold formulated, maintaining products on skin surface for longer time and improve the moisture retention.",
    "company_name": "Hunan Silok Silicone",
    "company_slug": "hunan-silok-silicone",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1708673244/production/Brand/27497/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/v1632515751/production/CategoryImage/1063/category_image/PersonalCare_05.jpg",
    "properties": {
        "Product Families": [
            "Rheology Modifiers",
            "Film Formers",
            "Functionals"
        ],
        "INCI Name": [
            "Isohexadecane",
            "Cocos Nucifera (Coconut) Oil",
            "Dimethicone Crosspolymer"
        ]
    },
    "summary": {
        "INCI Name": [
            "Dimethicone Crosspolymer",
            "Cocos Nucifera (Coconut) Oil",
            "Isohexadecane"
        ],
        "Functions": [
            "Thickener",
            "Film Former",
            "Viscosity Modifier"
        ],
        "Labeling Claims": [
            "Clean at Sephora",
            "Ulta Beauty's Conscious Beauty"
        ],
        "Benefit Claims": [
            "Wrinkle Refinement",
            "Oil Control",
            "Moisturizing"
        ]
    }
}