{
    "id": 402447,
    "brand": "solimide",
    "name": "SOLIMIDE® AC-550 (H)",
    "slug": "solimide-ac-550-h",
    "description": "SOLIMIDE® AC-550 (H) polyimide foam is utilized in aircraft and aerospace markets as a lightweight, non-wicking thermal and acoustic insulation material where low fire, toxicity and smoke generation are critical. It is formaldehydefree and demonstrates excellent long term stability under humid conditions and after temperature cycling. Similar to AC-550 foam, AC-550 (H) foam is slightly more dense for improved thermal properties. Applications include aircraft sidewalls and ECS systems, as well as cushioning, thermal protection and vibration damping in space applications. SOLIMIDE® AC-550 (H) foam can be cut into numerous shapes and sizes, and is compatible with many different facings, coatings and adhesives to meet end-use requirements.\" \"SOLIMIDE® AC-550 polyimide foam is utilized in aircraft and aerospace markets as a lightweight, non-wicking, thermal and acoustic insulation material where low fire, toxicity and smoke generation are critical. It is formaldehyde-free and demonstrates excellent long term stability under humid conditions and after temperature cycling.\r\n",
    "company_name": "Boyd Corporation",
    "company_slug": "boyd-corporation",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1702444509/production/Brand/30705/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/v1625608693/production/CategoryImage/573/category_image/AutomotiveTransportation_01.jpg",
    "properties": {
        "Applications": [
            "Advanced Materials",
            "Fillers, Levellers & Joints",
            "Equipment & Parts",
            "Other Flooring & Surface Applications",
            "Aerospace & Aviation",
            "Transportation",
            "Flooring & Surfaces",
            "Chemical & Industrial Manufacturing",
            "Military & Defense"
        ],
        "Product Families": [
            "Foams"
        ],
        "End Uses": [
            "Aerospace Applications",
            "Acoustic Barrier"
        ]
    },
    "summary": {
        "Foam Type": [
            "Open Cell Foam"
        ],
        "Density": [
            "7.990784 - 7.990784 kg/m³"
        ],
        "End Uses": [
            "Aerospace Applications",
            "Acoustic Barrier"
        ]
    }
}