{
    "id": 493787,
    "brand": "glycerin",
    "name": "Liquid Filled Packets",
    "slug": "liquid-filled-pouch-packaging",
    "description": "The demand for portion control is increasing annually, and our Liquid Filled Pouches provide the solution.According to the Freedonia industry study, global demand for pouches is projected to rise 6.2 percent annually to $37.3billion in 2018. The adoption of pouches with higher value features in developed markets — such as the US, Canada, Western Europe, and Japan — will support gains in dollar terms. Freedonia projects that food and beverage applications for pouches will continue to dominate over nonfood applications. Also leading to gains is the adoption of pouches by organic food providers who prefer to use lightweight and distinctive packaging to set their products apart from those offered by large ﬁrms.Gateway Food Products Company will be your partner throughout the entire process of developing a liquid pouch package based on your speciﬁcations. We have the capability of ﬁlling packages with widths ranging from 2.8” to 5.8” inches and lengths ranging from 1.5” to 6.3”. We can ﬁll packages with volumes as low as .25ml to a maximum of 4oz (120 ml), and with viscosities ranging from water to the thickness of peanut butter.Our packaging is available in a variety of ﬁlm materials, ranging from clear PET to printed aluminum. We offer low minimums on private label packaging. Contact us today to begin your project!",
    "company_name": "Gateway Food Products Company",
    "company_slug": "gateway-food-products-company",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1708108904/production/Company/46005/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_512/v1708108904/production/Brand/38973/card_banner/image",
    "properties": {
        "Applications": [
            "Cooking Oils & Fat Products",
            "Savory & Culinary",
            "Confectionery",
            "Food"
        ],
        "End Uses": [
            "Pancake Syrup",
            "Popcorn Oil",
            "Honey",
            "Condiments",
            "Dressings",
            "Syrups",
            "Soy Sauce",
            "Sauces",
            "Barbecue Sauce"
        ]
    },
    "summary": {}
}