{
    "id": 94842,
    "brand": "oleosense",
    "name": "Oléobooster® YOUTH",
    "slug": "oleobooster-youth",
    "description": "Oléobooster® YOUTH Protects against aging signs. Helps to delay skin aging and protects from daily external aggressions (UV rays, pollution,stress…). Skin aging is a physiological and natural phenomenon mainly caused by the effects of free radicals that can damage DNA, collagen and elastin, and induce the cellular degeneration. These free radicals are responsible for signs of premature skin aging such as wrinkles and loss of elasticity and density. Youth Oleobooster® is a micro-structured oily extract, stabilized by an oléo-éco-extraction patented green process. Rapeseed oil is a stable oil, rich in vitamin E, with a perfect balance of omega 3, 6 and 9 unsaturated fatty acids. Galanga and ginger antioxidants are extracted and vectorized by refined rapeseed oil, which facilitates the penetration of the active molecules into the epidermis. Thanks to its concentrated anti-free radical components, Youth Oleobooster® slows skin aging. This extract protects skin against aging signs, helps to delay skin aging and protects skin from daily external aggressions such as UV rays, pollution and stress. Youth Oleobooster® has a proven antiradical effect as demonstrated using the conjugated autoxidizable triene (CAT) method to measure a product’s ability to protect an oxidizable substrate placed in an emulsified medium in the presence of a free radicals initiator. On the basis of the CAT test results, a dose of 2% of Youth Oléobooster® increases anti-radical capacity by 40% versus rapeseed oil alone.",
    "company_name": "Oleos",
    "company_slug": "oleos",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1708689978/production/Company/1349/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_512/v1708689978/production/Company/1349/card_banner/image",
    "properties": {
        "Applications": [
            "Skin Care",
            "Beauty & Care"
        ],
        "Product Families": [
            "Conditioners & Emollients",
            "Sensory Modifiers",
            "Skin Actives",
            "Cosmetic Actives",
            "Functionals"
        ],
        "INCI Name": [
            "Zingiber Officinale (Ginger) Root Extract",
            "Brassica Campestris (Rapeseed) Seed Oil",
            "Alpinia Officinarum Root Extract"
        ]
    },
    "summary": {
        "INCI Name": [
            "Brassica Campestris (Rapeseed) Seed Oil",
            "Alpinia Officinarum Root Extract",
            "Zingiber Officinale (Ginger) Root Extract"
        ],
        "Functions": [
            "Smoothing Agent",
            "Soothing Agent",
            "Restoring Agent",
            "Anti-Aging Agent",
            "Antioxidant",
            "Protective Agent"
        ],
        "Labeling Claims": [
            "Preservative-free",
            "Organic"
        ],
        "Certifications & Compliance": [
            "Organic Certified",
            "Kosher",
            "EFISC",
            "ECOCERT",
            "Halal"
        ],
        "Benefit Claims": [
            "Anti-Pollution",
            "Repairing",
            "UV Protection",
            "Anti-Allergic",
            "Relaxing",
            "Anti-Irritant",
            "Moisturizing",
            "Antioxidant Properties",
            "Anti-Aging",
            "Sun Protection",
            "Stress Reducing",
            "Smoothing"
        ]
    }
}