{
    "id": 303972,
    "brand": "imagitint",
    "name": "IMagitroll 050 Titanium White 6",
    "slug": "imagitroll-050-titanium-white-6",
    "description": "IMagitroll 050 Titanium White 6 are high strength; pourable pigment dispersions specifically formulated for in-plant tinting and for use on dispensing machines - Automatic and Manual. These colorants are meant for tinting of Industrial Paints like, PU, Epoxy, Thermosetting Acrylics, Stoving Enamels, Stoving Lacquers, etc. Imagitroll 050 Industrial Colorants are cost economic alternatives to specific industrial pigment pastes containing industrial resins. Imagitroll Industrial Colorants are based on high quality pigments to provide light fastness, chemical resistance, and specific industrial performance. Imagitroll 050 Industrial Colorants use minimal of additives to ensure that these dispersions interfere as little as possible with the chemistry &amp; film properties of customer products. Imagitroll 050 Industrial Colorants are standardized with respect to color strength on a weight basis. Pigment loading varies from colorant to colorant. These colorants do not skin, have good anti-settling performance &amp; very low odor. These colorants are safe to handle &amp; have flash point above 65 deg. C. Predominant Solvent is having CAS No. 108-65-6.",
    "company_name": "Imagico India",
    "company_slug": "imagico-india",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1708516664/production/Company/24754/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/v1625609091/production/CategoryImage/594/category_image/PrintingPackaging_05.jpg",
    "properties": {
        "Applications": [
            "Industrial Maintenance",
            "Industrial Coatings"
        ],
        "Product Families": [
            "Inorganic Pigments",
            "Color Dispersions",
            "Dispersions & Masterbatches",
            "Color Pigments",
            "Pigments & Colorants"
        ],
        "Chemical Family": [
            "Titanium Compounds"
        ],
        "End Uses": [
            "Lacquers",
            "Enamel"
        ]
    },
    "summary": {
        "Chemical Family": [
            "Titanium Compounds"
        ],
        "Pigment Type": [
            "Inorganic Pigments"
        ],
        "Color": [
            "White"
        ],
        "Compatible Polymers & Resins": [
            "Epoxies (EP)",
            "Polyurethanes (PU)",
            "Acrylics"
        ],
        "Synonyms": [
            "TiO2, Titania, Titanium Peroxide"
        ]
    }
}