{
    "id": 359211,
    "brand": "the-frozen-flame-answer",
    "name": "The Heavy Cleaner-Mop Bucket Answer™",
    "slug": "the-heavy-cleaner-mop-bucket-answer",
    "description": "The Heavy Cleaner-Mop Bucket Answer™ excels in the commercial/industrial/agricultural arenas where it’s a safe and effective alternative for those currently using toxic chemical cleaners. This advanced biodegradable non-toxic formula lifts and then traps dirt and grease molecules for easy removal. The Heavy Cleaner-Mop Bucket Answer™ is a cleaner produced from alkaline water, manufactured by the WRJ-Ag-ROX EO Water Equipment, with a proprietary blend of surfactants, that takes the place of a wide range of harsh chemical cleaners. It is clear and nearly odorless, non-staining, non-flammable, and non-toxic. Extremely versatile, it can be used in hard, soft and salt water, and works well even in cold water. The Heavy Cleaner-Mop Bucket Answer™ is 100% biodegradable in the environment in the optimum desirable time of 7 days. Substances that biodegrade too quickly are considered “bio-stimulants” and pollutants as cleaners: Substances that biodegrade in excess of 7 days are classified as “hard” chemicals and are hazardous to human health. The greatly decreased hydrogen ion concentration (high pH) and balanced ORP (oxidation/reduction potential – measured in milli-volts) of The Heavy Cleaner-Mop Bucket Answer™ provides the necessary molecular energy for the maximum emulsifying and chelating action that is required to remove the oils, greases, protein, other substrate and invisible substances to which dirt, bacteria, fungus and algae adhere, and to remove carbon deposits and breaks down calcium and other scaling substances.",
    "company_name": "Environmental Care & Share",
    "company_slug": "environmental-care-share",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1664291110/production/Brand/26836/logo/image.png",
    "banner_url": "https://media.knowde.com/image/upload/v1625608186/production/CategoryImage/548/category_image/AgricultureFeed_04.jpg",
    "properties": {
        "Applications": [
            "Home Care",
            "Surface Care"
        ],
        "Product Families": [
            "Cleaners",
            "Industrial Cleaners",
            "Commercial Cleaners"
        ]
    },
    "summary": {
        "Ready to Use Product Type": [
            "Cleaner"
        ],
        "Certifications & Compliance": [
            "Kosher",
            "OMRI"
        ]
    }
}