{
    "id": 359214,
    "brand": "the-frozen-flame-answer",
    "name": "The Odor-Control Answer™",
    "slug": "the-odor-control-answer",
    "description": "The Odor-Control Answer™ is a highly concentrated biological system formulated to promote the remediation of odors and the organic waste from which they originate. Not an odor ‘cover-up’ nor a desensitizer for odor detecting receptors, the aerobic microbial stimulation of The Odor-Control Answer™ produces oxygen that mixes with other gasses thus oxidizing the odorous gasses. The Odor-Control Answer™ was designed for industry-leading dependability and rapid response to neutralizing and eliminating offensive, harsh odors. The Odor-Control Answer™ is an all natural, biochemical and non-toxic odor-control formula that will safely and completely remove, Not covering up, even the strongest odors. Completely safe to use around plants, animals and humans, and originally created to produce a healthier environment in agriculture for farmers, ranchers, personnel and animals, it is also effective for the common odor problems associated with food, smoke and waste in commercial and industrial facilities, restaurants, hotels, restroom facilities, etc. The Odor-Control Answer™ is proven to produce an overall healthier environment for humans and animals, while reducing toxic, waste gasses levels and ammonia (can be reduced between 50-70%) levels in manure and urine. It can reduce odor by at least 50 percent within the first fifteen minutes. It accomplishes its job by dispensing oxygen and deriving energy from the oxidation of mineral compounds and harmful gasses such as ammonia, hydrogen sulfide, carbon monoxide, sulfur dioxide and methane gas as it oxidizes and thereby reduces the odor,",
    "company_name": "Environmental Care & Share",
    "company_slug": "environmental-care-share",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1708690576/production/Brand/26839/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/v1625608186/production/CategoryImage/548/category_image/AgricultureFeed_04.jpg",
    "properties": {
        "Product Families": [
            "Odor Control Agents",
            "Performance Additives",
            "Functional Additives"
        ]
    },
    "summary": {
        "Functions": [
            "Odor Neutralizing Agent"
        ],
        "Labeling Claims": [
            "Environmentally Friendly",
            "Non-Toxic",
            "Kosher",
            "Biodegradable"
        ],
        "Certifications & Compliance": [
            "Kosher",
            "OMRI"
        ]
    }
}