{
    "id": 412938,
    "brand": "saris",
    "name": "SARIS Rose Essential Oil 100% (Rosa damascena)",
    "slug": "saris-rose-essential-oil-100-rosa-damascena",
    "description": "SARIS Rose Essential Oil 100% (Rosa damascena) soothes and harmonizes the mind and helps ease depression, anger, grief, fear, tension and stress. Improves sexuality, self-esteem and dealing with emotional issues.Rose oil is also an excellent remedy for poor circulation and heart problems, such as palpitation of the heart (tachycardia) and arrhythmia. It also helps with high blood pressure and is used to stimulate the liver and gall-bladder.When it comes to the respiratory system, rose oil helps with in cases of asthma, cough and hay fever.It cleanses the liver and helps with nausea.Rose oil has a strong cleansing effect on the female reproductive system and can be used to regulate and balance hormones, irregular menstruation, functional infertility, white flow, menorrhagia, uterine bleeding and other uterine issues, while having a tonic effect on the uterus.Applied on the skin, the essential oil has a moisturizing and hydrating effect. Rose oil has is an antiseptic which is suitable for all skin types and has a very good effect on dry and irritated skin. It is also used for ruptured capillaries, inflammation and redness of the skin as well as eczema and herpes.Inhaler application:In the treatment with steam, rose oil helps with allergies, asthma, anxiety, headaches, migraines, stress, etc. This oil is effective in dealing with depression, anger, grief and sadness.Application in massage oils &amp; baths:Rose oil mixed with massage oils or dissolved in a bath can help ease allergies, anxiety, asthma, fever, headache, depression, migraines, mild tension, depression, sadness, stress, tranquilizes cardiac rhythm, acts as a general tonic for the skin.Application in creams and lotions:Mixed in creams and lotions, rose oil stimulates the skin, as it has a moisturizing and hydrating effect. This works well for all skin types, but is especially useful for the dry and sensitive skin. The oil helps reduce redness and skin inflammations and acts as a general tonic.",
    "company_name": "SARIS Ltd.",
    "company_slug": "saris",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1704103711/production/Company/53434/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_512/v1704103711/production/Product/412938/card_banner/image",
    "properties": {
        "Applications": [
            "Bath & Shower",
            "Treatment Products",
            "Skin Care",
            "Beauty & Care"
        ],
        "Product Families": [
            "Essential Oils",
            "Vitamins, Extracts & Oils"
        ],
        "Chemical Family": [
            "Essential Oils"
        ],
        "INCI Name": [
            "Rosa Damascena Flower Oil"
        ],
        "End Uses": [
            "Rosacea (Redness) Treatment",
            "Eczema Treatment",
            "Massage Products"
        ],
        "Labeling Claims": [
            "Credo Clean Standard",
            "Ulta Beauty's Conscious Beauty",
            "Clean at Sephora",
            "Plant-Based",
            "Naturally Derived",
            "Natural"
        ],
        "Benefit Claims": [
            "Suitable for Sensitive Skin",
            "Stimulating",
            "Tonic effect",
            "Redness Reduction",
            "Anti-Inflammatory",
            "Hydrating",
            "Moisturizing",
            "Cardioprotective",
            "Stress Reducing",
            "Soothing"
        ]
    },
    "summary": {
        "INCI Name": [
            "Rosa Damascena Flower Oil"
        ],
        "Ingredient Origin": [
            "Natural Origin",
            "Plant Origin"
        ],
        "Benefit Claims": [
            "Stress Reducing",
            "Soothing",
            "Suitable for Sensitive Skin",
            "Anti-Inflammatory",
            "Redness Reduction",
            "Hydrating",
            "Stimulating",
            "Tonic effect",
            "Cardioprotective",
            "Moisturizing"
        ],
        "Labeling Claims": [
            "Natural",
            "Plant-Based",
            "Clean at Sephora",
            "Credo Clean Standard",
            "Naturally Derived",
            "Ulta Beauty's Conscious Beauty"
        ]
    }
}