{
    "id": 412942,
    "brand": "saris",
    "name": "SARIS Smoke Tree / Sumac Essential Oil (Cotinus coggygria)",
    "slug": "saris-smoke-tree-sumac-essential-oil-cotinus-coggygria",
    "description": "SARIS Smoke Tree / Sumac essential oil from Cotinus coggygria - one of the most powerful antiseptics in nature. Along with its other health-promoting properties (antibacterial, anti-inflammatory and antifungal), it is an important ingredient in various pharmaceutical and cosmetic products for the whole body.Usage: raw material for perfumery, cosmetics, aromatherapy, food industry, medicine and pharmacy. Applications:powerful disinfectant due to its natural antiseptic and antibacterial action (a few drops of it in a diffuser can help freshen and purify the air in any room)has antiviral propertiessoothes coughsgargling diluted in water sumac essential oil is recommended for acute and chronic inflammation of the oral cavity, laryngitis, pharyngitis, toothache, canker sores, bleeding gums and periodontitisused as insect repellentsupports skin health for occasional blemishes or irritations, dry skin, and cleansing.helps prevent sweaty feet (baths with water and a few drops of smoke tree essential oil)applied to the area of ​​injury or pain, soothes the inflammatory processes in the skin, relieves the swelling, helps heal hard-to-heal wounds, helps with itching, baby sores and skin irritations (commonly applied via compresses - a few drops of smoke tree oil are added to 10 ml of base oil)",
    "company_name": "SARIS Ltd.",
    "company_slug": "saris",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1704103777/production/Company/53434/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_512/v1704103777/production/Product/412942/card_banner/image",
    "properties": {
        "Applications": [
            "Fragrances & Perfumes",
            "Skin Care",
            "Beauty & Care"
        ],
        "Product Families": [
            "Essential Oils",
            "Vitamins, Extracts & Oils"
        ],
        "Chemical Family": [
            "Essential Oils"
        ],
        "INCI Name": [
            "Cotinus Coggygria Branch/Leaf Oil"
        ],
        "End Uses": [
            "Aromatherapy",
            "Fragrances & Perfumes"
        ]
    },
    "summary": {
        "INCI Name": [
            "Cotinus Coggygria Branch/Leaf Oil"
        ],
        "Ingredient Origin": [
            "Natural Origin",
            "Plant Origin"
        ],
        "Benefit Claims": [
            "Soothing",
            "Anti-Inflammatory",
            "Anti-Fungal",
            "Anti-Bacterial"
        ],
        "Labeling Claims": [
            "Naturally Derived",
            "Natural",
            "Plant-Based"
        ]
    }
}