{
    "id": 136002,
    "brand": "kimura",
    "name": "Perlast® G74P",
    "slug": "perlast-g74p",
    "description": "A translucent beige compound with semi-crystalline perfluoropolymer nano-filler, specially developed to meet the demands of the semiconductor and bio-analytical industries. Compatible with fluorine based chemistries and universally suitable for both wet and dry semiconductor processes including Lithography, Plasma, PVD, CVD, Etch, Stripping and Cleaning.Perlast® G74P combines a fully fluorinated polymer backbone, a fully fluorinated nano-filler system (no inorganic fillers) and a highly fluorinated cross-linking process, which results in a perfluoroelastomer with unrivaled purity, chemical resistance and mechanical properties.Perlast® G74P exhibits extremely low out-gassing properties, making it ideal for use in vacuum applications.Key Attributes Exceptionally pure - does not contain any inorganic fillers which may cause particulation problems. Excellent chemical and temperature resistance. Excellent mechanical properties. Extremely low out-gassing properties making it ideal for vacuum sealing applications. High material compliance reduces surface permeation. Reduced first wafer effect. Lower cost of ownership. Typical Applications Dynamic seals Static seals Wafer-handling products",
    "company_name": "Precision Polymer Engineering",
    "company_slug": "precision-polymer-engineering",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1703115207/production/Company/2831/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_512/v1703115207/production/Company/2831/card_banner/image",
    "properties": {
        "Applications": [
            "Semiconductor Manufacturing",
            "Other Industrial Applications",
            "Pipes & Plumbing",
            "Other Devices & Assemblies",
            "Building Materials",
            "Devices & Assemblies",
            "Parts & Components",
            "Chemical & Industrial Manufacturing"
        ],
        "Product Families": [
            "Fluoroelastomers",
            "Specialty Elastomers"
        ],
        "Chemical Family": [
            "Fluoropolymers"
        ],
        "Polymer Name": [
            "Perfluoroelastomer (FFKM)"
        ],
        "End Uses": [
            "Fittings",
            "Electrical/Electronic Applications"
        ]
    },
    "summary": {
        "Polymer Name": [
            "Perfluoroelastomer (FFKM)"
        ],
        "Features": [
            "High Purity",
            "Good Thermal Stability",
            "Heat Resistance",
            "Low Outgassing",
            "Chemical Resistant"
        ]
    }
}