{
    "id": 420031,
    "brand": "rainforest-blue",
    "name": "NATIVE EXTRACTS Native River Mint Leaf EssenXce",
    "slug": "native-extracts-native-river-mint-leaf-essenxce",
    "description": "Native River Mint Leaf EssenXce delivers breakthrough concentrations of the natural molecules this botanical species can offer in a water-soluble, solvent free format. Mentha australis (aka. “Native River Mint or Wild Mint) is a native of many areas in Australia, and sourced from an Indigenous Co-Op in South Australia. It is predicted to be a major player in natural skin care and Oral Care through its Cellular Extraction format. Now available in this highly concentrated format, its unique synergy between the phyto-compounds and their derivatives offers new possibilities as a powerful source of antioxidants, phenolics, rosmarinic acid and more. As ‘natural’ becomes synonymous with health, this Native EssenXce creates opportunities for brands and contract manufacturers to move away from synthetic ingredients and toward plant-based solutions. With new immunity boosters and internal beauty products on trend, these Native EssenXces translate to unique hero ingredients, connecting your brand to the natural source to bring out the brilliance of nature’s design through your NPD.",
    "company_name": "NATIVE EXTRACTS",
    "company_slug": "native-extracts",
    "logo_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_128/v1704103736/production/Company/54384/logo/image",
    "banner_url": "https://media.knowde.com/image/upload/f_auto,q_auto,w_512/v1704103736/production/Company/54384/card_banner/image",
    "properties": {
        "Applications": [
            "Skin Care",
            "Oral Care",
            "Beauty & Care"
        ],
        "Product Families": [
            "Botanical Ingredients & Extracts",
            "Vitamins, Extracts & Oils"
        ],
        "INCI Name": [
            "Mentha Australis Leaf Extract"
        ]
    },
    "summary": {
        "INCI Name": [
            "Mentha Australis Leaf Extract"
        ],
        "Ingredient Origin": [
            "Natural Origin",
            "Plant Origin"
        ],
        "Benefit Claims": [
            "Antioxidant Properties"
        ],
        "Labeling Claims": [
            "Environmentally Friendly",
            "Sustainable",
            "Natural"
        ],
        "Certifications & Compliance": [
            "ISO 9001"
        ]
    }
}